MorgothCreator/CppSDK/SDK/platform/stm32f7/interface/mmcsd.cpp
	/* Configure DMA Rx parameters */
	dma_rx_handle.Init.Channel = SD_DMAx_Rx_CHANNEL;
	dma_rx_handle.Init.Direction = DMA_PERIPH_TO_MEMORY;
	dma_rx_handle.Init.PeriphInc = DMA_PINC_DISABLE;
	dma_rx_handle.Init.MemInc = DMA_MINC_ENABLE;
	dma_rx_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
	dma_rx_handle.Init.MemDataAlignment = DMA_MDATAALIGN_WORD;
	dma_rx_handle.Init.Mode = DMA_PFCTRL;
	dma_rx_handle.Init.Priority = DMA_PRIORITY_VERY_HIGH;
	dma_rx_handle.Init.FIFOMode = DMA_FIFOMODE_ENABLE;
	dma_rx_handle.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
	dma_rx_handle.Init.MemBurst = DMA_MBURST_INC4;
	dma_rx_handle.Init.PeriphBurst = DMA_PBURST_INC4;

	dma_rx_handle.Instance = SD_DMAx_Rx_STREAM;

	/* Associate the DMA handle */
	__HAL_LINKDMA(hsd, hdmarx, dma_rx_handle);

	/* Deinitialize the stream for new transfer */
	HAL_DMA_DeInit(&dma_rx_handle);

	/* Configure the DMA stream */
	HAL_DMA_Init(&dma_rx_handle);

	/* Configure DMA Tx parameters */
	dma_tx_handle.Init.Channel = SD_DMAx_Tx_CHANNEL;
	dma_tx_handle.Init.Direction = DMA_MEMORY_TO_PERIPH;
	dma_tx_handle.Init.PeriphInc = DMA_PINC_DISABLE;
	dma_tx_handle.Init.MemInc = DMA_MINC_ENABLE;
	dma_tx_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
	dma_tx_handle.Init.MemDataAlignment = DMA_MDATAALIGN_WORD;
	dma_tx_handle.Init.Mode = DMA_PFCTRL;
	dma_tx_handle.Init.Priority = DMA_PRIORITY_VERY_HIGH;
	dma_tx_handle.Init.FIFOMode = DMA_FIFOMODE_ENABLE;
	dma_tx_handle.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
	dma_tx_handle.Init.MemBurst = DMA_MBURST_INC4;
	dma_tx_handle.Init.PeriphBurst = DMA_PBURST_INC4;

	dma_tx_handle.Instance = SD_DMAx_Tx_STREAM;

	/* Associate the DMA handle */
	__HAL_LINKDMA(hsd, hdmatx, dma_tx_handle);

	/* Deinitialize the stream for new transfer */
	HAL_DMA_DeInit(&dma_tx_handle);

	/* Configure the DMA stream */
	HAL_DMA_Init(&dma_tx_handle);

	/* NVIC configuration for DMA transfer complete interrupt */
	HAL_NVIC_SetPriority((IRQn_Type) SD_DMAx_Rx_IRQn, 6, 0);
	HAL_NVIC_EnableIRQ((IRQn_Type) SD_DMAx_Rx_IRQn);

	/* NVIC configuration for DMA transfer complete interrupt */
	HAL_NVIC_SetPriority((IRQn_Type) SD_DMAx_Tx_IRQn, 6, 0);
	HAL_NVIC_EnableIRQ((IRQn_Type) SD_DMAx_Tx_IRQn);
}

/**
 * @brief  Initializes the SD Detect pin MSP.
 * @param  hsd: SD handle
 * @retval None
 */
#if 0
__weak void BSP_SD_Detect_MspInit(SD_HandleTypeDef *hsd, void *Params)
{
	GPIO_InitTypeDef gpio_init_structure;

	SD_DETECT_GPIO_CLK_ENABLE();

	/* GPIO configuration in input for uSD_Detect signal */
	gpio_init_structure.Pin = SD_DETECT_PIN;
	gpio_init_structure.Mode = GPIO_MODE_INPUT;
	gpio_init_structure.Pull = GPIO_PULLUP;
	gpio_init_structure.Speed = GPIO_SPEED_HIGH;
	HAL_GPIO_Init(SD_DETECT_GPIO_PORT, &gpio_init_structure);
}
#endif
/**
 * @brief  DeInitializes the SD MSP.
 * @param  hsd: SD handle
 * @param  Params : pointer on additional configuration parameters, can be NULL.
 */
void GI::Dev::IntMmcSd::BSP_SD_MspDeInit(SD_HandleTypeDef *hsd, void *Params)
{
	static DMA_HandleTypeDef dma_rx_handle;
	static DMA_HandleTypeDef dma_tx_handle;

	/* Disable NVIC for DMA transfer complete interrupts */
	HAL_NVIC_DisableIRQ((IRQn_Type) SD_DMAx_Rx_IRQn);
	HAL_NVIC_DisableIRQ((IRQn_Type) SD_DMAx_Tx_IRQn);

	/* Deinitialize the stream for new transfer */
	dma_rx_handle.Instance = SD_DMAx_Rx_STREAM;
	HAL_DMA_DeInit(&dma_rx_handle);

	/* Deinitialize the stream for new transfer */
	dma_tx_handle.Instance = SD_DMAx_Tx_STREAM;
	HAL_DMA_DeInit(&dma_tx_handle);

	/* Disable NVIC for SDIO interrupts */
	HAL_NVIC_DisableIRQ((IRQn_Type) SDIO_IRQn);

	/* DeInit GPIO pins can be done in the application
	 (by surcharging this __weak function) */

	/* Disable SDIO clock */
	__HAL_RCC_SDIO_CLK_DISABLE();

	/* GPOI pins clock and DMA cloks can be shut down in the applic
	 by surcgarging this __weak function */
}

/**
 * @brief  Gets the current SD card data status.
 * @retval Data transfer state.
 *          This value can be one of the following values:
 *            @arg  SD_TRANSFER_OK: No data transfer is acting
 *            @arg  SD_TRANSFER_BUSY: Data transfer is acting
 *            @arg  SD_TRANSFER_ERROR: Data transfer error
 */
HAL_SD_TransferStateTypedef GI::Dev::IntMmcSd::BSP_SD_GetStatus(void)
{
	return (HAL_SD_GetStatus(&uSdHandle[0]));
}

/**
 * @brief  Get SD information about specific SD card.
 * @param  CardInfo: Pointer to HAL_SD_CardInfoTypedef structure
 */
void GI::Dev::IntMmcSd::BSP_SD_GetCardInfo(HAL_SD_CardInfoTypedef *CardInfo)
{
	/* Get SD card Information */
	HAL_SD_Get_CardInfo(&uSdHandle[0], CardInfo);
}

void GI::Dev::IntMmcSd::intIoctl(void *heandler, unsigned int command,
		unsigned int *buffer)
{
	if(!heandler)
	{
		*buffer = 0;
		return;
	}
	GI::Dev::IntMmcSd *_heandler = (GI::Dev::IntMmcSd *)heandler;
	HAL_SD_CardInfoTypedef* _SdCtrlStruct = &_heandler->uSdCardInfo;
	switch (command)
	{

	case GET_SECTOR_COUNT:
	{
		//if(_SdCtrlStruct->CardType == MMCSD_CARD_SD) *buffer = _SdCtrlStruct->card->nBlks;
		//else if(_SdCtrlStruct->card->cardType == MMCSD_CARD_MMC) *buffer = extCsd.sec_count;
		//else *buffer = 0;
		*buffer = _SdCtrlStruct->CardCapacity / _SdCtrlStruct->CardBlockSize;

		break;
	}
	case GET_SECTOR_SIZE:
	{
		*buffer = _SdCtrlStruct->CardBlockSize;

		break;
	}
	default:
	{
		*buffer = 0;
		break;
	}

	}
}

//HAL_SD_ErrorTypedef SD_WriteMultiBlocks(unsigned char *writebuff, unsigned long WriteAddr, uint16_t BlockSize, unsigned long NumberOfBlocks)
//HAL_SD_ErrorTypedef SD_WriteBlock(unsigned char *writebuff, unsigned long WriteAddr, uint16_t BlockSize)
//HAL_SD_ErrorTypedef SD_ReadMultiBlocks(unsigned char *readbuff, unsigned long ReadAddr, uint16_t BlockSize, unsigned long NumberOfBlocks)
//HAL_SD_ErrorTypedef SD_ReadBlock(unsigned char *readbuff, unsigned long ReadAddr, uint16_t BlockSize)

unsigned int GI::Dev::IntMmcSd::intRead(void *heandler, void *ptr,
		unsigned long block, unsigned int nblks)
{
	//if(!card_detected)
	//return 0;
	//HAL_SD_CardInfoTypedef *_SDCardInfo = (HAL_SD_CardInfoTypedef *)SdStruct;
	if(!heandler)
		return 0;
	GI::Dev::IntMmcSd *_heandler = (GI::Dev::IntMmcSd *)heandler;
	if (_heandler->cardStatusLedPinGpio)
		_heandler->cardStatusLedPinGpio->setOut(1);
	unsigned char status = MSD_OK;
	status = BSP_SD_ReadBlocks_DMA((unsigned long *) ptr, block << 9, 512,
			nblks);
	if (status == MSD_OK)
	{
		if (_heandler->cardStatusLedPinGpio)
			_heandler->cardStatusLedPinGpio->setOut(0);
		return 1;
	}
	else
	{
		if (_heandler->cardStatusLedPinGpio)
			_heandler->cardStatusLedPinGpio->setOut(0);
		return 0;
	}
}

unsigned int GI::Dev::IntMmcSd::intWrite(void *heandler, void *ptr,
		unsigned long block, unsigned int nblks)
{
	//HAL_SD_CardInfoTypedef *_SDCardInfo = (HAL_SD_CardInfoTypedef *)SdStruct;
	if(!heandler)
		return 0;
	GI::Dev::IntMmcSd *_heandler = (GI::Dev::IntMmcSd *)heandler;
	if (_heandler->cardStatusLedPinGpio)
		_heandler->cardStatusLedPinGpio->setOut(1);
	unsigned char status = MSD_OK;
	status = BSP_SD_WriteBlocks_DMA((unsigned long *) ptr, block << 9, 512,
			nblks);
	if (status == MSD_OK)
	{
		if (_heandler->cardStatusLedPinGpio)
			_heandler->cardStatusLedPinGpio->setOut(0);
		return 1;
	}
	else
	{
		if (_heandler->cardStatusLedPinGpio)
			_heandler->cardStatusLedPinGpio->setOut(0);
		return 0;
	}
}

