MorgothCreator/CppSDK/SDK/platform/stm32f7/interface/mmcsd.cpp
void GI::Dev::IntMmcSd::intIdle(void *handler)
{
	GI::Dev::IntMmcSd *intHandler = (GI::Dev::IntMmcSd *)handler;
	if (intHandler->cardDetectGpio != NULL)
	{
		intHandler->cardDetectGpio->idle();
		if (intHandler->cardDetectGpio->events.stateUp)
		{
			intHandler->cardDetectGpio->events.stateUp = false;
			intHandler->cardDetected = false;
		}
	}
	if (intHandler->cardDetectGpio == NULL || intHandler->cardDetectGpio->events.stateDown)
	{
		unsigned char res = SD_OK;
		res = BSP_SD_Init(intHandler);
		if (res != MSD_OK)
		{
			if (intHandler->cardDetectGpio != NULL)
				intHandler->cardDetectGpio->events.stateDown = false;
			//if(DebugCom)
			//UARTprintf(DebugCom,   "MMCSD%d ERROR initializing card.\n\r" , 0);
			intHandler->cardDetected = false;
			return;
		}
		if (intHandler->cardDetectGpio != NULL)
			intHandler->cardDetectGpio->events.stateDown = false;
		intMmcSdFatFs->fs.drv_rw_func.DriveStruct = (void *) intHandler;//SdStruct;
		intMmcSdFatFs->fs.drv_rw_func.drv_ioctl_func = intIoctl;
		intMmcSdFatFs->fs.drv_rw_func.drv_r_func = intRead;
		intMmcSdFatFs->fs.drv_rw_func.drv_w_func = intWrite;
#if (_FFCONF == 82786)
		if(!f_mount(2, &intMmcSdFatFs))
#else
		if (intMmcSdFatFs->mount("SD1:", 1) == FR_OK)
#endif
		{
			dir g_sDirObject = dir();
			if (g_sDirObject.fopendir(g_cCwdBuf0) == FR_OK)
			{
#if (MMCSD_DEBUG_EN == true)
				GI::IO::writeF((char *)CONSOLE_UART_OUT, (char *)"MMCSD%d drive %d mounted\n\r" , intHandler->unitNr , intHandler->unitNr);
				GI::IO::writeF((char *)CONSOLE_UART_OUT, (char *)"MMCSD%d Fat fs detected\n\r" , intHandler->unitNr);
				GI::IO::writeF((char *)CONSOLE_UART_OUT, (char *)"MMCSD%d Fs type:                 " , intHandler->unitNr);
				if(intMmcSdFatFs->fs.fs_type == FS_FAT12)
					GI::IO::write((char *)CONSOLE_UART_OUT, (char *)"Fat12");
				else if(intMmcSdFatFs->fs.fs_type == FS_FAT16)
					GI::IO::write((char *)CONSOLE_UART_OUT, (char *)"Fat16");
				else if(intMmcSdFatFs->fs.fs_type == FS_FAT32)
					GI::IO::write((char *)CONSOLE_UART_OUT, (char *)"Fat32");
				else if(intMmcSdFatFs->fs.fs_type == FS_EXFAT)
					GI::IO::write((char *)CONSOLE_UART_OUT, (char *)"exFat");
				else
					GI::IO::write((char *)CONSOLE_UART_OUT, (char *)"None");
				GI::IO::write((char *)CONSOLE_UART_OUT, (char *)"\n\r");
				//UARTprintf(DebugCom, "MMCSD0 BootSectorAddress:       %u \n\r",(unsigned int)g_sFatFs.);
				GI::IO::writeF((char *)CONSOLE_UART_OUT, (char *)"MMCSD%d BytesPerSector:          %d \n\r",0, /*(int)g_sFatFs.s_size*/512);
				GI::IO::writeF((char *)CONSOLE_UART_OUT, (char *)"MMCSD%d SectorsPerCluster:       %d \n\r",0, (int)intMmcSdFatFs->fs.csize);
				//UARTprintf(DebugCom, "MMCSD0 AllocTable1Begin:        %u \n\r",(unsigned int)g_sFatFs.fatbase);
				//UARTprintf(DebugCom, "MMCSD%d NumberOfFats:            %d \n\r",0, (int)intMmcSdFatFs.n_fats);
				//UARTprintf(DebugCom, "MMCSD0 MediaType:               %d \n\r",Drives_Table[0]->DiskInfo_MediaType);
				//UARTprintf(DebugCom, "MMCSD0 AllocTableSize:          %u \n\r",Drives_Table[0]->DiskInfo_AllocTableSize);
				//UARTprintf(DebugCom, "MMCSD%d DataSectionBegin:        %d \n\r",0, (int)intMmcSdFatFs.fatbase);
				GI::IO::writeF((char *)CONSOLE_UART_OUT, (char *)"MMCSD%d uSD DiskCapacity:        %uMB\n\r",0, (unsigned long)((unsigned long long)((unsigned long long)intMmcSdFatFs->fs.n_fatent * (unsigned long long)/*g_sFatFs.s_size*/512 *(unsigned long long)intMmcSdFatFs->fs.csize) / 1000000));
#endif
				intHandler->cardDetected = true;
			}
			else GI::IO::writeF((char *)CONSOLE_UART_OUT, (char *)"MMCSD_SPI%d ERROR oppening path\n\r" , intHandler->unitNr);
		}
		else GI::IO::writeF((char *)CONSOLE_UART_OUT, (char *)"MMCSD_SPI%d ERROR mounting disk\n\r" , intHandler->unitNr);
	}
	return;
}
/*#####################################################*/
void GI::Dev::IntMmcSd::intGetRawCid(void *handler, unsigned long *rawCid)
{
	GI::Dev::IntMmcSd *intHandler = (GI::Dev::IntMmcSd *)handler;
	rawCid[0] = uSdHandle[intHandler->unitNr].CID[0];
	rawCid[1] = uSdHandle[intHandler->unitNr].CID[1];
	rawCid[2] = uSdHandle[intHandler->unitNr].CID[2];
	rawCid[3] = uSdHandle[intHandler->unitNr].CID[3];
}

void GI::Dev::IntMmcSd::intGetRawCsd(void *handler, unsigned long *rawCsd)
{
	GI::Dev::IntMmcSd *intHandler = (GI::Dev::IntMmcSd *)handler;
	unsigned char *csd = (unsigned char *)uSdHandle[intHandler->unitNr].CSD;
	rawCsd[0] = ((unsigned long)csd[15] + ((unsigned long)csd[14] << 8) +  ((unsigned long)csd[13] << 16) +  ((unsigned long)csd[12] << 24));
	rawCsd[1] = ((unsigned long)csd[11] + ((unsigned long)csd[10] << 8) +  ((unsigned long)csd[9] << 16) +  ((unsigned long)csd[8] << 24));
	rawCsd[2] = ((unsigned long)csd[7] + ((unsigned long)csd[6] << 8) +  ((unsigned long)csd[5] << 16) +  ((unsigned long)csd[4] << 24));
	rawCsd[3] = ((unsigned long)csd[3] + ((unsigned long)csd[2] << 8) +  ((unsigned long)csd[1] << 16) +  ((unsigned long)csd[0] << 24));
}

/*-----------------------------------------------------------------------*/
/* Inidialize a Drive                                                    */
/*-----------------------------------------------------------------------*/

GI::Dev::IntMmcSd::IntMmcSd(unsigned int unitNr, char *cardDetectPinPath, char *cardStatusLedPinPath) :
		cardDetected(false)
{
	if(GI::Dev::DevRequest::request(cardDetectPinPath, &cardDetectGpio) == SYS_ERR_OK)
		cardDetectGpio->lastState = true;
	GI::Dev::DevRequest::request(cardStatusLedPinPath, &cardStatusLedPinGpio);
	intMmcSdFatFs = new fatfs();
    idle_Ptr = &GI::Dev::IntMmcSd::intIdle;
    read_Ptr = &GI::Dev::IntMmcSd::intRead;
    write_Ptr = &GI::Dev::IntMmcSd::intWrite;
    ioctl_Ptr = &GI::Dev::IntMmcSd::intIoctl;
    getRawCid_Ptr = &GI::Dev::IntMmcSd::intGetRawCid;
    getRawCsd_Ptr = &GI::Dev::IntMmcSd::intGetRawCsd;
    this->unitNr = unitNr;
    driverHandler_Ptr = (void*)this;
    intIdle(driverHandler_Ptr);
}

GI::Dev::IntMmcSd::~IntMmcSd()
{
}
/******************************************************************************/
/*                 STM32F7xx Peripherals Interrupt Handlers                   */
/*  Add here the Interrupt Handler for the used peripheral(s) (PPP), for the  */
/*  available peripheral interrupt handler's name please refer to the startup */
/*  file (startup_stm32f7xx.s).                                               */
/******************************************************************************/
#ifdef __cplusplus
extern "C"
{
#endif

/**
 * @brief  This function handles DMA2 Stream 3 interrupt request.
 * @param  None
 * @retval None
 */
void DMA2_Stream0_IRQHandler(void)
{
	HAL_DMA_IRQHandler(uSdHandle[0].hdmarx);
}

/**
 * @brief  This function handles DMA2 Stream 6 interrupt request.
 * @param  None
 * @retval None
 */
void DMA2_Stream5_IRQHandler(void)
{
	HAL_DMA_IRQHandler(uSdHandle[0].hdmatx);
}

/**
 * @brief  This function handles SDIO interrupt request.
 * @param  None
 * @retval None
 */
void SDMMC2_IRQHandler(void)
{
	HAL_SD_IRQHandler(&uSdHandle[0]);

}
#ifdef __cplusplus
}
#endif

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/*********** Portions COPYRIGHT 2012 Embest Tech. Co., Ltd.*****END OF FILE****/
